#ifndef PERECHENDRWINGCONSTANTS_H
#define PERECHENDRWINGCONSTANTS_H
#include <QVector>

double Basicline = 0.6;
double Thinline = 0.2;

struct TextElement {
    double x1;      // Координата x верхнего левого угла
    double y1;      // Координата y верхнего левого угла
    double size;    // Размер шрифта
    double angle;   // Угол поворота текста
    QString position;   // Позиция текста (HVCenter, и т.д.)
    QString var;    // Переменная (для vtext)
    QString content;    // Текстовое содержимое элемента
    double width;   // Ширина элемента (для текстовых элементов, где указана)
};

//List1 PE
QVector<QVector<double>> ramka_A4_PE = {
    {20, 5, 20, 292, Basicline},
    {20, 292, 205, 292, Basicline},
    {205, 292, 205, 5, Basicline},
    {205, 5, 20, 5, Basicline}
};

QVector<QVector<double>> Title_block_List1vp_TextDocuments = {
    { 125, 0, 125, 22, Basicline },          // Первая линия
    { 111, 8, 111, 22, Basicline },          // Вторая линия
    { 58, 8, 58, 22, Basicline },            // Третья линия
    { 125, 8, 5, 8, Basicline },     // Четвёртая линия
    { 125, 22, 5, 22, Basicline }    // Пятая линия
};

QVector<TextElement> Title_block_List1_TextDocuments_textData_A4_PE = {
    { -50.5, -26.4, 3.5, 0, "HVCenter", "", "Лит.", 0 },
    { -114.467, -0.771, 3.5, 0, "", "", "Копировал", 0 },
    { -36.5, -0.771, 3.5, 0, "", "", "Формат А4", 0 },
    { -109, -9, 3.5, 0, "", "", "Перечень элементов", 17 },
    { -134.5, -31.5, 3.5, 0, "HVCenter", "", "Дата", 10 },
    { -147, -31.5, 3.5, 0, "HVCenter", "", "Подп.", 0 },
    { -170, -31.5, 3.5, 0, "HVCenter", "", "№ докум.", 0 },
    { -182.5, -31.5, 3.5, 0, "HVCenter", "", "Лист", 10 },
    { -190, -31.5, 3.5, 0, "HVCenter", "", "Изм.", 8 },
    { -189.467, -25.771, 3.5, 0, "", "", "Разраб.", 17 },
    { -189.467, -20.771, 3.5, 0, "", "", "Пров.", 17 },
    { -189.467, -15.771, 3.5, 0, "", "Должность", "", 17 },
    { -189.467, -10.771, 3.5, 0, "", "", "Н.контр.", 17 },
    { -189.467, -5.771, 3.5, 0, "", "", "Утв.", 17 },
    { -36.5, -26.4, 3.5, 0, "HVCenter", "", "Лист", 0 },
    { -21, -26.4, 3.5, 0, "HVCenter", "", "Листов", 0 }
};

QVector<TextElement> Title_block_List1_TextDocuments_textData_A4 = {
    { -50.5, -26.4, 3.5, 0, "HVCenter", "", "Лит.", 0 },
    { -114.467, -0.771, 3.5, 0, "", "", "Копировал", 0 },
    { -36.5, -0.771, 3.5, 0, "", "", "Формат А4", 0 },
    { -134.5, -31.5, 3.5, 0, "HVCenter", "", "Дата", 10 },
    { -147, -31.5, 3.5, 0, "HVCenter", "", "Подп.", 0 },
    { -170, -31.5, 3.5, 0, "HVCenter", "", "№ докум.", 0 },
    { -182.5, -31.5, 3.5, 0, "HVCenter", "", "Лист", 10 },
    { -190, -31.5, 3.5, 0, "HVCenter", "", "Изм.", 8 },
    { -189.467, -25.771, 3.5, 0, "", "", "Разраб.", 17 },
    { -189.467, -20.771, 3.5, 0, "", "", "Пров.", 17 },
    { -189.467, -15.771, 3.5, 0, "", "Должность", "", 17 },
    { -189.467, -10.771, 3.5, 0, "", "", "Н.контр.", 17 },
    { -189.467, -5.771, 3.5, 0, "", "", "Утв.", 17 },
    { -36.5, -26.4, 3.5, 0, "HVCenter", "", "Лист", 0 },
    { -21, -26.4, 3.5, 0, "HVCenter", "", "Листов", 0 }
};

QVector<QVector<double>> Title_block_List1_TextDocuments = {
    { 190, 5.5, 190, 45, Basicline },   // Первая линия
    { 190, 10, 125, 10, Thinline },   // Вторая линия
    { 190, 15, 125, 15, Thinline },   // Третья линия
    { 190, 20, 125, 20, Thinline },   // Четвёртая линия
    { 190, 25, 125, 25, Thinline },   // Пятая линия
    { 190, 30, 5, 30, Basicline },    // Шестая линия
    { 190, 35, 125, 35, Basicline },  // Седьмая линия
    { 190, 40, 125, 40, Thinline },   // Восьмая линия
    { 190, 45, 5, 45, Basicline },    // Девятая линия
    { 55, 20, 5, 20, Basicline },     // Десятая линия
    { 55, 25, 5, 25, Basicline },     // Одиннадцатая линия
    { 183, 30, 183, 45, Basicline },  // Двенадцатая линия
    { 173, 5.5, 173, 45, Basicline },   // Тринадцатая линия
    { 150, 5.5, 150, 45, Basicline },   // Четырнадцатая линия
    { 135, 5.5, 135, 45, Basicline },   // Пятнадцатая линия
    { 125, 5.5, 125, 45, Basicline },   // Шестнадцатая линия
    { 55, 5.5, 55, 30, Basicline },     // Семнадцатая линия
    { 50, 20, 50, 25, Thinline },     // Восемнадцатая линия
    { 45, 20, 45, 25, Thinline },     // Девятнадцатая линия
    { 40, 20, 40, 30, Basicline },    // Двадцатая линия
    { 25, 20, 25, 30, Basicline }     // Двадцать первая линия
};

QVector<QVector<double>> Left_block_List1 = {
    { 13, 172.4, 13, 292.4, Basicline },  // Первая линия
    { 13, 5.4, 13, 150.4, Basicline },    // Вторая линия
    { 8, 292.4, 20, 292.4, Basicline },   // Третья линия
    { 8, 232.4, 20, 232.4, Basicline },   // Четвёртая линия
    { 8, 172.4, 8, 292.4, Basicline },    // Пятая линия
    { 8, 172.4, 20, 172.4, Basicline },   // Шестая линия
    { 8, 150.4, 20, 150.4, Basicline },   // Седьмая линия
    { 8, 115.4, 20, 115.4, Basicline },   // Восьмая линия
    { 8, 90.4, 20, 90.4, Basicline },     // Девятая линия
    { 8, 65.4, 20, 65.4, Basicline },     // Десятая линия
    { 8, 30.4, 20, 30.4, Basicline },     // Одиннадцатая линия
    { 8, 5.4, 8, 150.4, Basicline },      // Двенадцатая линия
    { 8, 5.4, 20, 5.4, Basicline }        // Тринадцатая линия 5
};

QVector<TextElement> Left_block_List1_textElements = {
    {11.5, 247.4, 3.5, 90, "HVCenter90", "", "Перв. примен.", 59},
    {11.5, 195.4, 3.5, 90, "HVCenter90", "", "Справ. №", 59},
    {11.5, 120.4, 3.5, 90, "HVCenter90", "", "Подп. и дата", 33.5},
    {11.5, 90.9, 3.5, 90, "HVCenter90", "", "Инв. № дубл.", 23.5},
    {11.5, 66.4, 3.5, 90, "HVCenter90", "", "Взам. инв. №", 23.5},
    {11.5, 36.4, 3.5, 90, "HVCenter90", "", "Подп. и дата", 33.5},
    {11.5, 6.9, 3.5, 90, "HVCenter90", "", "Инв. № подл.", 23.5}
};

QVector<QVector<double>> Top_block_PE = {
    { 20, 20, 205, 20, Basicline },   // Первая линия
    { 40, 5, 40, 20, Basicline },     // Вторая линия
    { 150, 5, 150, 20, Basicline },   // Третья линия
    { 160, 5, 160, 20, Basicline }    // Четвёртая линия
};

QVector<TextElement> Top_block_PE_textElements = {
    {26, 9, 3.5, 0, "HVCenter", "", "Поз.", 0},
    {23, 14, 3.5, 0, "HVCenter", "", "обозна-", 0},
    {25, 19, 3.5, 0, "HVCenter", "", "чение", 0},
    {87, 14, 3.5, 0, "HVCenter", "", "Наименование", 0},
    {150.5, 14, 3.5, 0, "HVCenter", "", "Кол.", 0},
    {172, 14, 3.5, 0, "HVCenter", "", "Примечание", 0}
};

QVector<QVector<double>> Lines_A4_PE_3lines_List1 = {
    { 20, 69, 205, 69, Thinline },   // Первая линия
    { 20, 61, 205, 61, Thinline },   // Вторая линия
    { 20, 53, 205, 53, Thinline },   // Третья линия
    { 40, 53, 40, 77, Basicline },   // Четвёртая линия
    { 150, 53, 150, 77, Basicline }, // Пятая линия
    { 160, 53, 160, 77, Basicline }  // Шестая линия
};

QVector<QVector<double>> Lines_A4_PE_25lines_List1 = {
    { 20, 269, 205, 269, Thinline },   // Первая линия
    { 20, 261, 205, 261, Thinline },   // Вторая линия
    { 20, 253, 205, 253, Thinline },   // Третья линия
    { 20, 245, 205, 245, Thinline },   // Четвёртая линия
    { 20, 237, 205, 237, Thinline },   // Пятая линия
    { 20, 229, 205, 229, Thinline },   // Шестая линия
    { 20, 221, 205, 221, Thinline },   // Седьмая линия
    { 20, 213, 205, 213, Thinline },   // Восьмая линия
    { 20, 205, 205, 205, Thinline },   // Девятая линия
    { 20, 197, 205, 197, Thinline },   // Десятая линия
    { 20, 189, 205, 189, Thinline },   // Одиннадцатая линия
    { 20, 181, 205, 181, Thinline },   // Двенадцатая линия
    { 20, 173, 205, 173, Thinline },   // Тринадцатая линия
    { 20, 165, 205, 165, Thinline },   // Четырнадцатая линия
    { 20, 157, 205, 157, Thinline },   // Пятнадцатая линия
    { 20, 149, 205, 149, Thinline },   // Шестнадцатая линия
    { 20, 141, 205, 141, Thinline },   // Семнадцатая линия
    { 20, 133, 205, 133, Thinline },   // Восемнадцатая линия
    { 20, 125, 205, 125, Thinline },   // Девятнадцатая линия
    { 20, 117, 205, 117, Thinline },   // Двадцатая линия
    { 20, 109, 205, 109, Thinline },   // Двадцать первая линия
    { 20, 101, 205, 101, Thinline },   // Двадцать вторая линия
    { 20, 93, 205, 93, Thinline },     // Двадцать третья линия
    { 20, 85, 205, 85, Thinline },     // Двадцать четвёртая линия
    { 20, 77, 205, 77, Thinline },     // Двадцать пятая линия
    { 40, 77, 40, 277, Basicline },    // Двадцать шестая линия
    { 150, 77, 150, 277, Basicline },  // Двадцать седьмая линия
    { 160, 77, 160, 277, Basicline }   // Двадцать восьмая линия
};

//List2 PE
QVector<QVector<double>> Title_block_List2 = {
    {-15, 13, -5, 13, Basicline},
    {-15, 5.5, -15, 20, Basicline},
    {-125, 5.5, -125, 20, Basicline},
    {-135, 10, -125, 10, Basicline},
    {-135, 5.5, -135, 20, Basicline},
    {-150, 10, -135, 10, Basicline},
    {-150, 5.5, -150, 20, Basicline},
    {-173, 10, -150, 10, Basicline},
    {-173, 5.5, -173, 20, Basicline},
    {-183, 10, -173, 10, Basicline},
    {-183, 5.5, -183, 20, Basicline},
    {-190, 20, -5, 20, Basicline},
    {-190, 15, -125, 15, Thinline},
    {-190, 10, -183, 10, Basicline},
    {-190, 5.5, -190, 20, Basicline}
};

QVector<TextElement> Title_block_List2_textElements_A4 = {
    {-134.5, 6, 3.5, 0, "HCenter", "", "Дата", 10},
    {-147, 6, 3.5, 0, "HCenter", "", "Подп.", 0},
    {-170, 6, 3.5, 0, "HCenter", "", "№ докум.", 0},
    {-190, 6, 3.5, 0, "HCenter", "", "Изм.", 8},
    {-182.5, 6, 3.5, 0, "HCenter", "", "Лист", 10},
    {-114.467, 0.771, 3.5, 0, "", "", "Копировал", 0},
    {-36.5, 0.771, 3.5, 0, "", "", "Формат А4", 0 },
    {-14.5, 14.5, 3.5, 0, "HCenter", "", "Лист", 10}
};

QVector<TextElement> Title_block_List2_textElements_A3 = {
    {-134.5, 6, 3.5, 0, "HCenter", "", "Дата", 10},
    {-147, 6, 3.5, 0, "HCenter", "", "Подп.", 0},
    {-170, 6, 3.5, 0, "HCenter", "", "№ докум.", 0},
    {-190, 6, 3.5, 0, "HCenter", "", "Изм.", 8},
    {-182.5, 6, 3.5, 0, "HCenter", "", "Лист", 10},
    {-114.467, 0.771, 3.5, 0, "", "", "Копировал", 0},
    {-36.5, 0.771, 3.5, 0, "", "", "Формат А3", 0 },
    {-14.5, 14.5, 3.5, 0, "HCenter", "", "Лист", 10}
};

QVector<QVector<double>> Left_block_List2 = {
    {13, 5.4, 13, 150.4, Basicline},
    {8, 150.4, 20, 150.4, Basicline},
    {8, 115.4, 20, 115.4, Basicline},
    {8, 90.4, 20, 90.4, Basicline},
    {8, 65.4, 20, 65.4, Basicline},
    {8, 30.4, 20, 30.4, Basicline},
    {8, 5.4, 8, 150.4, Basicline},
    {8, 5.4, 20, 5.4, Basicline}
};

QVector<TextElement> Left_block_List2_textElements = {
    {11.5, 120, 3.5, 90, "HVCenter90", "", "Подп. и дата", 33.5},
    {11.5, 90.5, 3.5, 90, "HVCenter90", "", "Инв. № дубл.", 23.5},
    {11.5, 66, 3.5, 90, "HVCenter90", "", "Взам. инв. №", 23.5},
    {11.5, 36, 3.5, 90, "HVCenter90", "", "Подп. и дата", 33.5},
    {11.5, 6.5, 3.5, 90, "HVCenter90", "", "Инв. № подл.", 23.5}
};

QVector<QVector<double>> Lines_A4_PE_List2 = {
    {20, 269, 205, 269, Thinline},
    {20, 261, 205, 261, Thinline},
    {20, 253, 205, 253, Thinline},
    {20, 245, 205, 245, Thinline},
    {20, 237, 205, 237, Thinline},
    {20, 229, 205, 229, Thinline},
    {20, 221, 205, 221, Thinline},
    {20, 213, 205, 213, Thinline},
    {20, 205, 205, 205, Thinline},
    {20, 197, 205, 197, Thinline},
    {20, 189, 205, 189, Thinline},
    {20, 181, 205, 181, Thinline},
    {20, 173, 205, 173, Thinline},
    {20, 165, 205, 165, Thinline},
    {20, 157, 205, 157, Thinline},
    {20, 149, 205, 149, Thinline},
    {20, 141, 205, 141, Thinline},
    {20, 133, 205, 133, Thinline},
    {20, 125, 205, 125, Thinline},
    {20, 117, 205, 117, Thinline},
    {20, 109, 205, 109, Thinline},
    {20, 101, 205, 101, Thinline},
    {20, 93, 205, 93, Thinline},
    {20, 85, 205, 85, Thinline},
    {20, 77, 205, 77, Thinline},
    {20, 69, 205, 69, Thinline},
    {20, 61, 205, 61, Thinline},
    {20, 53, 205, 53, Thinline},
    {20, 45, 205, 45, Thinline},
    {20, 37, 205, 37, Thinline},
    {20, 29, 205, 29, Thinline},
    {40, 29, 40, 277, Basicline},
    {150, 29, 150, 277, Basicline},
    {160, 29, 160, 277, Basicline}
};

#endif // PERECHENDRWINGCONSTANTS_H
